workshop3/OpenFoam/cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/parameters"

convertToMeters 1.0;

vertices
(
    (0 0 -0.1)
    ($dim 0 -0.1)
    ($dim $dim -0.1)
    (0 $dim -0.1)
    
    (0 0 0.1)
    ($dim 0 0.1)
    ($dim $dim 0.1)
    (0 $dim 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($size $size 1) simpleGrading (1 1 1)
        /*simpleGrading
            (
                ( ( 0.2 0.3 4 ) ( 0.6 0.4 1 ) ( 0.2 0.3 0.25 ) )
                ( ( 0.2 0.3 4 ) ( 0.6 0.4 1 ) ( 0.2 0.3 0.25 ) )
                1
            )*/
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
