workshop3/OpenFoam/cavity/constant/parameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
    location    "constant";
    object      parameters;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Mesh parameters
dim     1.0;
mid     0.5;
size    64;

// Simulation parameters
simTime 70.0;
dt      1e-3;
tol     1e-6;

// Physical parameters
vel     1.0;
re      100.0;
nu      0.01;
c2      5.8;

// ************************************************************************* //
